# PartsCannotBeMerged Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures..::..PartsCannotBeMerged Property
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class See Also
---
This PartMaker refers to parts which cannot be merged.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartsCannotBeMerged { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartsCannotBeMerged As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartsCannotBeMerged {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace